espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_struct.h
/** Type of ahb_pdma_in_ch2_intr_map register
 *  AHB_PDMA_IN_CH2_INTR mapping register
 */
typedef union {
    struct {
        /** ahb_pdma_in_ch2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ahb_pdma_in_ch2_intr_map:6;
        uint32_t reserved_6:2;
        /** ahb_pdma_in_ch2_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t ahb_pdma_in_ch2_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_ahb_pdma_in_ch2_intr_map_reg_t;

/** Type of ahb_pdma_in_ch3_intr_map register
 *  AHB_PDMA_IN_CH3_INTR mapping register
 */
typedef union {
    struct {
        /** ahb_pdma_in_ch3_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ahb_pdma_in_ch3_intr_map:6;
        uint32_t reserved_6:2;
        /** ahb_pdma_in_ch3_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t ahb_pdma_in_ch3_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_ahb_pdma_in_ch3_intr_map_reg_t;

/** Type of ahb_pdma_in_ch4_intr_map register
 *  AHB_PDMA_IN_CH4_INTR mapping register
 */
typedef union {
    struct {
        /** ahb_pdma_in_ch4_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ahb_pdma_in_ch4_intr_map:6;
        uint32_t reserved_6:2;
        /** ahb_pdma_in_ch4_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t ahb_pdma_in_ch4_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_ahb_pdma_in_ch4_intr_map_reg_t;

/** Type of ahb_pdma_out_ch0_intr_map register
 *  AHB_PDMA_OUT_CH0_INTR mapping register
 */
typedef union {
    struct {
        /** ahb_pdma_out_ch0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ahb_pdma_out_ch0_intr_map:6;
        uint32_t reserved_6:2;
        /** ahb_pdma_out_ch0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t ahb_pdma_out_ch0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_ahb_pdma_out_ch0_intr_map_reg_t;

/** Type of ahb_pdma_out_ch1_intr_map register
 *  AHB_PDMA_OUT_CH1_INTR mapping register
 */
typedef union {
    struct {
        /** ahb_pdma_out_ch1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ahb_pdma_out_ch1_intr_map:6;
        uint32_t reserved_6:2;
        /** ahb_pdma_out_ch1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t ahb_pdma_out_ch1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_ahb_pdma_out_ch1_intr_map_reg_t;

/** Type of ahb_pdma_out_ch2_intr_map register
 *  AHB_PDMA_OUT_CH2_INTR mapping register
 */
typedef union {
    struct {
        /** ahb_pdma_out_ch2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ahb_pdma_out_ch2_intr_map:6;
        uint32_t reserved_6:2;
        /** ahb_pdma_out_ch2_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t ahb_pdma_out_ch2_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_ahb_pdma_out_ch2_intr_map_reg_t;

/** Type of ahb_pdma_out_ch3_intr_map register
 *  AHB_PDMA_OUT_CH3_INTR mapping register
 */
typedef union {
    struct {
        /** ahb_pdma_out_ch3_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ahb_pdma_out_ch3_intr_map:6;
        uint32_t reserved_6:2;
        /** ahb_pdma_out_ch3_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t ahb_pdma_out_ch3_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_ahb_pdma_out_ch3_intr_map_reg_t;

/** Type of ahb_pdma_out_ch4_intr_map register
 *  AHB_PDMA_OUT_CH4_INTR mapping register
 */
typedef union {
    struct {
        /** ahb_pdma_out_ch4_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ahb_pdma_out_ch4_intr_map:6;
        uint32_t reserved_6:2;
        /** ahb_pdma_out_ch4_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t ahb_pdma_out_ch4_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_ahb_pdma_out_ch4_intr_map_reg_t;

