espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_struct.h
/** Type of hp_parlio_rx_intr_map register
 *  HP_PARLIO_RX_INTR mapping register
 */
typedef union {
    struct {
        /** hp_parlio_rx_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_parlio_rx_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_parlio_rx_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t hp_parlio_rx_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_hp_parlio_rx_intr_map_reg_t;

/** Type of hp_parlio_tx_intr_map register
 *  HP_PARLIO_TX_INTR mapping register
 */
typedef union {
    struct {
        /** hp_parlio_tx_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_parlio_tx_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_parlio_tx_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t hp_parlio_tx_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_hp_parlio_tx_intr_map_reg_t;

/** Type of bus_monitor_intr_map register
 *  BUS_MONITOR_INTR mapping register
 */
typedef union {
    struct {
        /** bus_monitor_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t bus_monitor_intr_map:6;
        uint32_t reserved_6:2;
        /** bus_monitor_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t bus_monitor_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_bus_monitor_intr_map_reg_t;

/** Type of modem_wifi_mac_intr_map register
 *  MODEM_WIFI_MAC_INTR mapping register
 */
typedef union {
    struct {
        /** modem_wifi_mac_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_wifi_mac_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_wifi_mac_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_wifi_mac_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_modem_wifi_mac_intr_map_reg_t;

/** Type of modem_wifi_mac_nmi_intr_map register
 *  MODEM_WIFI_MAC_NMI_INTR mapping register
 */
typedef union {
    struct {
        /** modem_wifi_mac_nmi_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_wifi_mac_nmi_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_wifi_mac_nmi_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_wifi_mac_nmi_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_modem_wifi_mac_nmi_intr_map_reg_t;

/** Type of modem_wifi_pwr_intr_map register
 *  MODEM_WIFI_PWR_INTR mapping register
 */
typedef union {
    struct {
        /** modem_wifi_pwr_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_wifi_pwr_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_wifi_pwr_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_wifi_pwr_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_modem_wifi_pwr_intr_map_reg_t;

/** Type of modem_wifi_bb_intr_map register
 *  MODEM_WIFI_BB_INTR mapping register
 */
typedef union {
    struct {
        /** modem_wifi_bb_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_wifi_bb_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_wifi_bb_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_wifi_bb_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_modem_wifi_bb_intr_map_reg_t;

/** Type of modem_bt_mac_intr_map register
 *  MODEM_BT_MAC_INTR mapping register
 */
typedef union {
    struct {
        /** modem_bt_mac_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_bt_mac_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_bt_mac_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_bt_mac_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_modem_bt_mac_intr_map_reg_t;

/** Type of modem_bt_bb_intr_map register
 *  MODEM_BT_BB_INTR mapping register
 */
typedef union {
    struct {
        /** modem_bt_bb_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_bt_bb_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_bt_bb_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_bt_bb_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_modem_bt_bb_intr_map_reg_t;

