espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_struct.h
/** Type of pmu_reg_1_intr_map register
 *  PMU_REG_1_INTR mapping register
 */
typedef union {
    struct {
        /** pmu_reg_1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t pmu_reg_1_intr_map:6;
        uint32_t reserved_6:2;
        /** pmu_reg_1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t pmu_reg_1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_pmu_reg_1_intr_map_reg_t;

/** Type of lp_anaperi_intr_map register
 *  LP_ANAPERI_INTR mapping register
 */
typedef union {
    struct {
        /** lp_anaperi_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_anaperi_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_anaperi_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_anaperi_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_anaperi_intr_map_reg_t;

/** Type of lp_adc_intr_map register
 *  LP_ADC_INTR mapping register
 */
typedef union {
    struct {
        /** lp_adc_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_adc_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_adc_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_adc_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_adc_intr_map_reg_t;

/** Type of lp_dac_intr_map register
 *  LP_DAC_INTR mapping register
 */
typedef union {
    struct {
        /** lp_dac_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_dac_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_dac_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_dac_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_dac_intr_map_reg_t;

/** Type of lp_gpio_intr_map register
 *  LP_GPIO_INTR mapping register
 */
typedef union {
    struct {
        /** lp_gpio_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_gpio_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_gpio_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_gpio_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_gpio_intr_map_reg_t;

/** Type of lp_i2c_intr_map register
 *  LP_I2C_INTR mapping register
 */
typedef union {
    struct {
        /** lp_i2c_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_i2c_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_i2c_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_i2c_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_i2c_intr_map_reg_t;

/** Type of lp_spi_intr_map register
 *  LP_SPI_INTR mapping register
 */
typedef union {
    struct {
        /** lp_spi_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_spi_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_spi_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_spi_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_spi_intr_map_reg_t;

/** Type of lp_touch_intr_map register
 *  LP_TOUCH_INTR mapping register
 */
typedef union {
    struct {
        /** lp_touch_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_touch_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_touch_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_touch_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_touch_intr_map_reg_t;

