espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_struct.h
/** Type of lp_tsens_intr_map register
 *  LP_TSENS_INTR mapping register
 */
typedef union {
    struct {
        /** lp_tsens_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_tsens_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_tsens_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_tsens_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_tsens_intr_map_reg_t;

/** Type of lp_uart_intr_map register
 *  LP_UART_INTR mapping register
 */
typedef union {
    struct {
        /** lp_uart_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_uart_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_uart_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_uart_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_uart_intr_map_reg_t;

/** Type of lp_efuse_intr_map register
 *  LP_EFUSE_INTR mapping register
 */
typedef union {
    struct {
        /** lp_efuse_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_efuse_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_efuse_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_efuse_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_efuse_intr_map_reg_t;

/** Type of lp_sw_intr_map register
 *  LP_SW_INTR mapping register
 */
typedef union {
    struct {
        /** lp_sw_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_sw_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_sw_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_sw_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_sw_intr_map_reg_t;

/** Type of lp_trng_intr_map register
 *  LP_TRNG_INTR mapping register
 */
typedef union {
    struct {
        /** lp_trng_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_trng_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_trng_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_trng_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_trng_intr_map_reg_t;

/** Type of lp_sysreg_intr_map register
 *  LP_SYSREG_INTR mapping register
 */
typedef union {
    struct {
        /** lp_sysreg_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_sysreg_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_sysreg_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_sysreg_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_sysreg_intr_map_reg_t;

/** Type of lp_apm_m0_intr_map register
 *  LP_APM_M0_INTR mapping register
 */
typedef union {
    struct {
        /** lp_apm_m0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_apm_m0_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_apm_m0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_apm_m0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_apm_m0_intr_map_reg_t;

/** Type of lp_apm_m1_intr_map register
 *  LP_APM_M1_INTR mapping register
 */
typedef union {
    struct {
        /** lp_apm_m1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_apm_m1_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_apm_m1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_apm_m1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_apm_m1_intr_map_reg_t;

