espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_struct.h
/** Type of lp_apm_m2_intr_map register
 *  LP_APM_M2_INTR mapping register
 */
typedef union {
    struct {
        /** lp_apm_m2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_apm_m2_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_apm_m2_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_apm_m2_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_apm_m2_intr_map_reg_t;

/** Type of lp_apm_m3_intr_map register
 *  LP_APM_M3_INTR mapping register
 */
typedef union {
    struct {
        /** lp_apm_m3_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_apm_m3_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_apm_m3_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_apm_m3_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_apm_m3_intr_map_reg_t;

/** Type of lp_peri0_pms_intr_map register
 *  LP_PERI0_PMS_INTR mapping register
 */
typedef union {
    struct {
        /** lp_peri0_pms_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_peri0_pms_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_peri0_pms_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_peri0_pms_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_peri0_pms_intr_map_reg_t;

/** Type of lp_peri1_pms_intr_map register
 *  LP_PERI1_PMS_INTR mapping register
 */
typedef union {
    struct {
        /** lp_peri1_pms_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_peri1_pms_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_peri1_pms_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_peri1_pms_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_peri1_pms_intr_map_reg_t;

/** Type of lp_huk_intr_map register
 *  LP_HUK_INTR mapping register
 */
typedef union {
    struct {
        /** lp_huk_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_huk_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_huk_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_huk_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_huk_intr_map_reg_t;

/** Type of lp_peri_timeout_intr_map register
 *  LP_PERI_TIMEOUT_INTR mapping register
 */
typedef union {
    struct {
        /** lp_peri_timeout_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_peri_timeout_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_peri_timeout_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_peri_timeout_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_peri_timeout_intr_map_reg_t;

/** Type of lp_ahb_pdma_in_ch0_intr_map register
 *  LP_AHB_PDMA_IN_CH0_INTR mapping register
 */
typedef union {
    struct {
        /** lp_ahb_pdma_in_ch0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_ahb_pdma_in_ch0_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_ahb_pdma_in_ch0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_ahb_pdma_in_ch0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_ahb_pdma_in_ch0_intr_map_reg_t;

/** Type of lp_ahb_pdma_in_ch1_intr_map register
 *  LP_AHB_PDMA_IN_CH1_INTR mapping register
 */
typedef union {
    struct {
        /** lp_ahb_pdma_in_ch1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_ahb_pdma_in_ch1_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_ahb_pdma_in_ch1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_ahb_pdma_in_ch1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core1_lp_ahb_pdma_in_ch1_intr_map_reg_t;

