espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_struct.h
/** Type of src_pass_in_m_status_5 register
 *  machine-mode PASS_IN_M status register for interrupt sources 160 ~ 168
 */
typedef union {
    struct {
        /** int_src_pass_in_m_status_5 : RO; bitpos: [8:0]; default: 0;
         *  Represents the machine-mode PASS_IN status of the interrupt sources with
         *  interrupt-index-range 160 ~ 168. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in machine-mode.
         *  1:The corresponding interrupt source is PASS in machine-mode.
         */
        uint32_t int_src_pass_in_m_status_5:9;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core1_src_pass_in_m_status_5_reg_t;

/** Type of config_state register
 *  reserved
 */
typedef union {
    struct {
        /** sig_idx_assert_s_err : RO; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t sig_idx_assert_s_err:1;
        /** sig_idx_assert_m_err : RO; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t sig_idx_assert_m_err:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} interrupt_core1_config_state_reg_t;

/** Type of s_status register
 *  reserved
 */
typedef union {
    struct {
        /** int_s_status : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t int_s_status:32;
    };
    uint32_t val;
} interrupt_core1_s_status_reg_t;

/** Type of m_status register
 *  reserved
 */
typedef union {
    struct {
        /** int_m_status : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t int_m_status:32;
    };
    uint32_t val;
} interrupt_core1_m_status_reg_t;


/** Group: Version Register */
/** Type of interrupt_date register
 *  Version control register
 */
typedef union {
    struct {
        /** interrupt_date : R/W; bitpos: [27:0]; default: 38834448;
         *  Version control register
         */
        uint32_t interrupt_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} interrupt_core1_interrupt_date_reg_t;


typedef struct {
    volatile interrupt_core1_sys_icm_intr_map_reg_t sys_icm_intr_map;
    volatile interrupt_core1_axi_perf_mon_intr_map_reg_t axi_perf_mon_intr_map;
    volatile interrupt_core1_usb_device_intr_map_reg_t usb_device_intr_map;
    volatile interrupt_core1_sdio_host_intr_map_reg_t sdio_host_intr_map;
    volatile interrupt_core1_spi2_intr_map_reg_t spi2_intr_map;
    volatile interrupt_core1_spi3_intr_map_reg_t spi3_intr_map;
    volatile interrupt_core1_i2s0_intr_map_reg_t i2s0_intr_map;
    volatile interrupt_core1_i2s1_intr_map_reg_t i2s1_intr_map;
    volatile interrupt_core1_uhci0_intr_map_reg_t uhci0_intr_map;
    volatile interrupt_core1_uart0_intr_map_reg_t uart0_intr_map;
    volatile interrupt_core1_uart1_intr_map_reg_t uart1_intr_map;
    volatile interrupt_core1_uart2_intr_map_reg_t uart2_intr_map;
    volatile interrupt_core1_uart3_intr_map_reg_t uart3_intr_map;
    volatile interrupt_core1_lcd_cam_intr_map_reg_t lcd_cam_intr_map;
    volatile interrupt_core1_pwm0_intr_map_reg_t pwm0_intr_map;
    volatile interrupt_core1_pwm1_intr_map_reg_t pwm1_intr_map;
    volatile interrupt_core1_pwm2_intr_map_reg_t pwm2_intr_map;
    volatile interrupt_core1_pwm3_intr_map_reg_t pwm3_intr_map;
    volatile interrupt_core1_can0_intr_map_reg_t can0_intr_map;
    volatile interrupt_core1_can0_timer_intr_map_reg_t can0_timer_intr_map;
    volatile interrupt_core1_can1_intr_map_reg_t can1_intr_map;
    volatile interrupt_core1_can1_timer_intr_map_reg_t can1_timer_intr_map;
    volatile interrupt_core1_rmt_intr_map_reg_t rmt_intr_map;
    volatile interrupt_core1_i2c0_intr_map_reg_t i2c0_intr_map;
    volatile interrupt_core1_i2c1_intr_map_reg_t i2c1_intr_map;
    volatile interrupt_core1_timergrp0_t0_intr_map_reg_t timergrp0_t0_intr_map;
    volatile interrupt_core1_timergrp0_t1_intr_map_reg_t timergrp0_t1_intr_map;
    volatile interrupt_core1_timergrp0_wdt_intr_map_reg_t timergrp0_wdt_intr_map;
    volatile interrupt_core1_timergrp1_t0_intr_map_reg_t timergrp1_t0_intr_map;
    volatile interrupt_core1_timergrp1_t1_intr_map_reg_t timergrp1_t1_intr_map;
    volatile interrupt_core1_timergrp1_wdt_intr_map_reg_t timergrp1_wdt_intr_map;
    volatile interrupt_core1_ledc0_intr_map_reg_t ledc0_intr_map;
    volatile interrupt_core1_ledc1_intr_map_reg_t ledc1_intr_map;
    volatile interrupt_core1_systimer_target0_intr_map_reg_t systimer_target0_intr_map;
    volatile interrupt_core1_systimer_target1_intr_map_reg_t systimer_target1_intr_map;
    volatile interrupt_core1_systimer_target2_intr_map_reg_t systimer_target2_intr_map;
    volatile interrupt_core1_ahb_pdma_in_ch0_intr_map_reg_t ahb_pdma_in_ch0_intr_map;
    volatile interrupt_core1_ahb_pdma_in_ch1_intr_map_reg_t ahb_pdma_in_ch1_intr_map;
    volatile interrupt_core1_ahb_pdma_in_ch2_intr_map_reg_t ahb_pdma_in_ch2_intr_map;
    volatile interrupt_core1_ahb_pdma_in_ch3_intr_map_reg_t ahb_pdma_in_ch3_intr_map;
    volatile interrupt_core1_ahb_pdma_in_ch4_intr_map_reg_t ahb_pdma_in_ch4_intr_map;
    volatile interrupt_core1_ahb_pdma_out_ch0_intr_map_reg_t ahb_pdma_out_ch0_intr_map;
    volatile interrupt_core1_ahb_pdma_out_ch1_intr_map_reg_t ahb_pdma_out_ch1_intr_map;
    volatile interrupt_core1_ahb_pdma_out_ch2_intr_map_reg_t ahb_pdma_out_ch2_intr_map;
    volatile interrupt_core1_ahb_pdma_out_ch3_intr_map_reg_t ahb_pdma_out_ch3_intr_map;
    volatile interrupt_core1_ahb_pdma_out_ch4_intr_map_reg_t ahb_pdma_out_ch4_intr_map;
    volatile interrupt_core1_asrc_chnl0_intr_map_reg_t asrc_chnl0_intr_map;
    volatile interrupt_core1_asrc_chnl1_intr_map_reg_t asrc_chnl1_intr_map;
    volatile interrupt_core1_axi_pdma_in_ch0_intr_map_reg_t axi_pdma_in_ch0_intr_map;
    volatile interrupt_core1_axi_pdma_in_ch1_intr_map_reg_t axi_pdma_in_ch1_intr_map;
    volatile interrupt_core1_axi_pdma_in_ch2_intr_map_reg_t axi_pdma_in_ch2_intr_map;
    volatile interrupt_core1_axi_pdma_out_ch0_intr_map_reg_t axi_pdma_out_ch0_intr_map;
    volatile interrupt_core1_axi_pdma_out_ch1_intr_map_reg_t axi_pdma_out_ch1_intr_map;
    volatile interrupt_core1_axi_pdma_out_ch2_intr_map_reg_t axi_pdma_out_ch2_intr_map;
    volatile interrupt_core1_rsa_intr_map_reg_t rsa_intr_map;
    volatile interrupt_core1_aes_intr_map_reg_t aes_intr_map;
    volatile interrupt_core1_sha_intr_map_reg_t sha_intr_map;
    volatile interrupt_core1_ecc_intr_map_reg_t ecc_intr_map;
    volatile interrupt_core1_ecdsa_intr_map_reg_t ecdsa_intr_map;
    volatile interrupt_core1_km_intr_map_reg_t km_intr_map;
    volatile interrupt_core1_rma_intr_map_reg_t rma_intr_map;
    volatile interrupt_core1_gpio_intr0_map_reg_t gpio_intr0_map;
    volatile interrupt_core1_gpio_intr1_map_reg_t gpio_intr1_map;
    volatile interrupt_core1_gpio_intr2_map_reg_t gpio_intr2_map;
    volatile interrupt_core1_gpio_intr3_map_reg_t gpio_intr3_map;
    volatile interrupt_core1_cpu_intr_from_cpu_0_map_reg_t cpu_intr_from_cpu_0_map;
    volatile interrupt_core1_cpu_intr_from_cpu_1_map_reg_t cpu_intr_from_cpu_1_map;
    volatile interrupt_core1_cpu_intr_from_cpu_2_map_reg_t cpu_intr_from_cpu_2_map;
    volatile interrupt_core1_cpu_intr_from_cpu_3_map_reg_t cpu_intr_from_cpu_3_map;
    volatile interrupt_core1_cache_intr_map_reg_t cache_intr_map;
    volatile interrupt_core1_cpu_apm_m0_intr_map_reg_t cpu_apm_m0_intr_map;
    volatile interrupt_core1_cpu_apm_m1_intr_map_reg_t cpu_apm_m1_intr_map;
    volatile interrupt_core1_cpu_apm_m2_intr_map_reg_t cpu_apm_m2_intr_map;
    volatile interrupt_core1_cpu_apm_m3_intr_map_reg_t cpu_apm_m3_intr_map;
    volatile interrupt_core1_hp_mem_apm_m0_intr_map_reg_t hp_mem_apm_m0_intr_map;
    volatile interrupt_core1_hp_mem_apm_m1_intr_map_reg_t hp_mem_apm_m1_intr_map;
    volatile interrupt_core1_hp_mem_apm_m2_intr_map_reg_t hp_mem_apm_m2_intr_map;
    volatile interrupt_core1_hp_mem_apm_m3_intr_map_reg_t hp_mem_apm_m3_intr_map;
    volatile interrupt_core1_hp_mem_apm_m4_intr_map_reg_t hp_mem_apm_m4_intr_map;
    volatile interrupt_core1_hp_mem_apm_m5_intr_map_reg_t hp_mem_apm_m5_intr_map;
    volatile interrupt_core1_cpu_peri0_timeout_intr_map_reg_t cpu_peri0_timeout_intr_map;
    volatile interrupt_core1_cpu_peri1_timeout_intr_map_reg_t cpu_peri1_timeout_intr_map;
    volatile interrupt_core1_hp_peri0_timeout_intr_map_reg_t hp_peri0_timeout_intr_map;
    volatile interrupt_core1_hp_peri1_timeout_intr_map_reg_t hp_peri1_timeout_intr_map;
    volatile interrupt_core1_hp_apm_m0_intr_map_reg_t hp_apm_m0_intr_map;
    volatile interrupt_core1_hp_apm_m1_intr_map_reg_t hp_apm_m1_intr_map;
    volatile interrupt_core1_hp_apm_m2_intr_map_reg_t hp_apm_m2_intr_map;
    volatile interrupt_core1_hp_apm_m3_intr_map_reg_t hp_apm_m3_intr_map;
    volatile interrupt_core1_hp_apm_m4_intr_map_reg_t hp_apm_m4_intr_map;
    volatile interrupt_core1_hp_apm_m5_intr_map_reg_t hp_apm_m5_intr_map;
    volatile interrupt_core1_hp_apm_m6_intr_map_reg_t hp_apm_m6_intr_map;
    volatile interrupt_core1_hp_peri0_pms_intr_map_reg_t hp_peri0_pms_intr_map;
    volatile interrupt_core1_hp_peri1_pms_intr_map_reg_t hp_peri1_pms_intr_map;
    volatile interrupt_core1_cpu0_peri_pms_intr_map_reg_t cpu0_peri_pms_intr_map;
    volatile interrupt_core1_cpu1_peri_pms_intr_map_reg_t cpu1_peri_pms_intr_map;
    volatile interrupt_core1_flash_mspi_intr_map_reg_t flash_mspi_intr_map;
    volatile interrupt_core1_lpi_intr_map_reg_t lpi_intr_map;
    volatile interrupt_core1_pmt_intr_map_reg_t pmt_intr_map;
    volatile interrupt_core1_sbd_intr_map_reg_t sbd_intr_map;
    volatile interrupt_core1_usb_otghs_intr_map_reg_t usb_otghs_intr_map;
    volatile interrupt_core1_usb_otghs_endp_multi_proc_intr_map_reg_t usb_otghs_endp_multi_proc_intr_map;
    volatile interrupt_core1_jpeg_intr_map_reg_t jpeg_intr_map;
    volatile interrupt_core1_ppa_intr_map_reg_t ppa_intr_map;
    volatile interrupt_core1_core0_trace_intr_map_reg_t core0_trace_intr_map;
    volatile interrupt_core1_core1_trace_intr_map_reg_t core1_trace_intr_map;
    volatile interrupt_core1_dma2d_in_ch0_intr_map_reg_t dma2d_in_ch0_intr_map;
    volatile interrupt_core1_dma2d_in_ch1_intr_map_reg_t dma2d_in_ch1_intr_map;
    volatile interrupt_core1_dma2d_in_ch2_intr_map_reg_t dma2d_in_ch2_intr_map;
    volatile interrupt_core1_dma2d_out_ch0_intr_map_reg_t dma2d_out_ch0_intr_map;
    volatile interrupt_core1_dma2d_out_ch1_intr_map_reg_t dma2d_out_ch1_intr_map;
    volatile interrupt_core1_dma2d_out_ch2_intr_map_reg_t dma2d_out_ch2_intr_map;
    volatile interrupt_core1_dma2d_out_ch3_intr_map_reg_t dma2d_out_ch3_intr_map;
    volatile interrupt_core1_psram_mspi_intr_map_reg_t psram_mspi_intr_map;
    volatile interrupt_core1_hp_sysreg_intr_map_reg_t hp_sysreg_intr_map;
    volatile interrupt_core1_pcnt0_intr_map_reg_t pcnt0_intr_map;
    volatile interrupt_core1_pcnt1_intr_map_reg_t pcnt1_intr_map;
    volatile interrupt_core1_hp_pau_intr_map_reg_t hp_pau_intr_map;
    volatile interrupt_core1_hp_parlio_rx_intr_map_reg_t hp_parlio_rx_intr_map;
    volatile interrupt_core1_hp_parlio_tx_intr_map_reg_t hp_parlio_tx_intr_map;
    volatile interrupt_core1_bus_monitor_intr_map_reg_t bus_monitor_intr_map;
    volatile interrupt_core1_modem_wifi_mac_intr_map_reg_t modem_wifi_mac_intr_map;
    volatile interrupt_core1_modem_wifi_mac_nmi_intr_map_reg_t modem_wifi_mac_nmi_intr_map;
    volatile interrupt_core1_modem_wifi_pwr_intr_map_reg_t modem_wifi_pwr_intr_map;
    volatile interrupt_core1_modem_wifi_bb_intr_map_reg_t modem_wifi_bb_intr_map;
    volatile interrupt_core1_modem_bt_mac_intr_map_reg_t modem_bt_mac_intr_map;
    volatile interrupt_core1_modem_bt_bb_intr_map_reg_t modem_bt_bb_intr_map;
    volatile interrupt_core1_modem_bt_bb_nmi_intr_map_reg_t modem_bt_bb_nmi_intr_map;
    volatile interrupt_core1_modem_lp_timer_intr_map_reg_t modem_lp_timer_intr_map;
    volatile interrupt_core1_modem_coex_intr_map_reg_t modem_coex_intr_map;
    volatile interrupt_core1_modem_ble_timer_intr_map_reg_t modem_ble_timer_intr_map;
    volatile interrupt_core1_modem_ble_sec_intr_map_reg_t modem_ble_sec_intr_map;
    volatile interrupt_core1_modem_i2c_mst_intr_map_reg_t modem_i2c_mst_intr_map;
    volatile interrupt_core1_modem_zb_mac_intr_map_reg_t modem_zb_mac_intr_map;
    volatile interrupt_core1_modem_bt_mac_int1_intr_map_reg_t modem_bt_mac_int1_intr_map;
    volatile interrupt_core1_cordic_intr_map_reg_t cordic_intr_map;
    volatile interrupt_core1_zero_det_intr_map_reg_t zero_det_intr_map;
    volatile interrupt_core1_lp_wdt_intr_map_reg_t lp_wdt_intr_map;
    volatile interrupt_core1_lp_timer_reg_0_intr_map_reg_t lp_timer_reg_0_intr_map;
    volatile interrupt_core1_lp_timer_reg_1_intr_map_reg_t lp_timer_reg_1_intr_map;
    volatile interrupt_core1_mb_hp_intr_map_reg_t mb_hp_intr_map;
    volatile interrupt_core1_mb_lp_intr_map_reg_t mb_lp_intr_map;
    volatile interrupt_core1_pmu_reg_0_intr_map_reg_t pmu_reg_0_intr_map;
    volatile interrupt_core1_pmu_reg_1_intr_map_reg_t pmu_reg_1_intr_map;
    volatile interrupt_core1_lp_anaperi_intr_map_reg_t lp_anaperi_intr_map;
    volatile interrupt_core1_lp_adc_intr_map_reg_t lp_adc_intr_map;
    volatile interrupt_core1_lp_dac_intr_map_reg_t lp_dac_intr_map;
    volatile interrupt_core1_lp_gpio_intr_map_reg_t lp_gpio_intr_map;
    volatile interrupt_core1_lp_i2c_intr_map_reg_t lp_i2c_intr_map;
    volatile interrupt_core1_lp_spi_intr_map_reg_t lp_spi_intr_map;
    volatile interrupt_core1_lp_touch_intr_map_reg_t lp_touch_intr_map;
    volatile interrupt_core1_lp_tsens_intr_map_reg_t lp_tsens_intr_map;
    volatile interrupt_core1_lp_uart_intr_map_reg_t lp_uart_intr_map;
    volatile interrupt_core1_lp_efuse_intr_map_reg_t lp_efuse_intr_map;
    volatile interrupt_core1_lp_sw_intr_map_reg_t lp_sw_intr_map;
    volatile interrupt_core1_lp_trng_intr_map_reg_t lp_trng_intr_map;
    volatile interrupt_core1_lp_sysreg_intr_map_reg_t lp_sysreg_intr_map;
    volatile interrupt_core1_lp_apm_m0_intr_map_reg_t lp_apm_m0_intr_map;
    volatile interrupt_core1_lp_apm_m1_intr_map_reg_t lp_apm_m1_intr_map;
    volatile interrupt_core1_lp_apm_m2_intr_map_reg_t lp_apm_m2_intr_map;
    volatile interrupt_core1_lp_apm_m3_intr_map_reg_t lp_apm_m3_intr_map;
    volatile interrupt_core1_lp_peri0_pms_intr_map_reg_t lp_peri0_pms_intr_map;
    volatile interrupt_core1_lp_peri1_pms_intr_map_reg_t lp_peri1_pms_intr_map;
    volatile interrupt_core1_lp_huk_intr_map_reg_t lp_huk_intr_map;
    volatile interrupt_core1_lp_peri_timeout_intr_map_reg_t lp_peri_timeout_intr_map;
    volatile interrupt_core1_lp_ahb_pdma_in_ch0_intr_map_reg_t lp_ahb_pdma_in_ch0_intr_map;
    volatile interrupt_core1_lp_ahb_pdma_in_ch1_intr_map_reg_t lp_ahb_pdma_in_ch1_intr_map;
    volatile interrupt_core1_lp_ahb_pdma_out_ch0_intr_map_reg_t lp_ahb_pdma_out_ch0_intr_map;
    volatile interrupt_core1_lp_ahb_pdma_out_ch1_intr_map_reg_t lp_ahb_pdma_out_ch1_intr_map;
    volatile interrupt_core1_lp_sw_invalid_sleep_intr_map_reg_t lp_sw_invalid_sleep_intr_map;
    volatile interrupt_core1_sig_idx_assert_in_sec_reg_t sig_idx_assert_in_sec;
    volatile interrupt_core1_int_status_reg_0_reg_t int_status_reg_0;
    volatile interrupt_core1_int_status_reg_1_reg_t int_status_reg_1;
    volatile interrupt_core1_int_status_reg_2_reg_t int_status_reg_2;
    volatile interrupt_core1_int_status_reg_3_reg_t int_status_reg_3;
    volatile interrupt_core1_int_status_reg_4_reg_t int_status_reg_4;
    volatile interrupt_core1_int_status_reg_5_reg_t int_status_reg_5;
    volatile interrupt_core1_src_pass_in_s_status_0_reg_t src_pass_in_s_status_0;
    volatile interrupt_core1_src_pass_in_s_status_1_reg_t src_pass_in_s_status_1;
    volatile interrupt_core1_src_pass_in_s_status_2_reg_t src_pass_in_s_status_2;
    volatile interrupt_core1_src_pass_in_s_status_3_reg_t src_pass_in_s_status_3;
    volatile interrupt_core1_src_pass_in_s_status_4_reg_t src_pass_in_s_status_4;
    volatile interrupt_core1_src_pass_in_s_status_5_reg_t src_pass_in_s_status_5;
    volatile interrupt_core1_src_pass_in_m_status_0_reg_t src_pass_in_m_status_0;
    volatile interrupt_core1_src_pass_in_m_status_1_reg_t src_pass_in_m_status_1;
    volatile interrupt_core1_src_pass_in_m_status_2_reg_t src_pass_in_m_status_2;
    volatile interrupt_core1_src_pass_in_m_status_3_reg_t src_pass_in_m_status_3;
    volatile interrupt_core1_src_pass_in_m_status_4_reg_t src_pass_in_m_status_4;
    volatile interrupt_core1_src_pass_in_m_status_5_reg_t src_pass_in_m_status_5;
    volatile interrupt_core1_config_state_reg_t config_state;
    volatile interrupt_core1_s_status_reg_t s_status;
    volatile interrupt_core1_m_status_reg_t m_status;
    volatile interrupt_core1_clock_gate_reg_t clock_gate;
    uint32_t reserved_300[319];
    volatile interrupt_core1_interrupt_date_reg_t interrupt_date;
} interrupt_core1_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(interrupt_core1_dev_t) == 0x800, "Invalid size of interrupt_core1_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
